#ifndef __SPECAREALIB_H
#define __SPECAREALIB_H

#ifdef __cplusplus
extern "C"{
#endif


/*******************************驱动以及基本流程测试接口函数************************************
**
**形参说明：
**          node_name:节点名；如防护存储器挂载节点为"/dev/sdb"，传入此字符串即可
**          p_err    :异常代码值，当返回值为7、11或15时，可读取p_err值进一步诊断指令异常的原因
**           
**
**返回说明：
**          return  0:测试流程完成
**
**                 -1:未找到节点
**                 -2:找到节点但是无法打开节点
**
**                  1:进入特定指令模式异常
**                  2:退出特定指令模式异常
**
**                  3:存储器状态异常
**
**                  4:写保护使能异常-特征字异常
**                  5:写保护使能异常-获取数据长度异常
**                  6:写保护使能异常-指令设置异常
**                  7:写保护使能异常-指令应答异常,并可通过p_err读取异常代码
**                  8:写保护使能异常-流程异常

**                  9:写保护激活异常-特征字异常
**                  10:写保护激活异常-指令设置异常
**                  11:写保护激活异常-指令应答异常,并可通过p_err读取异常代码
**                  12:写保护激活异常-流程异常
**
**                  13:单次解锁异常-特征字异常
**                  14:单次解锁异常-指令设置异常
**                  15:单次解锁异常-指令应答异常,并可通过p_err读取异常代码
**                  16:单次解锁异常-流程异常
**
**                  17:数据读写异常
**                  18:关键参数解密异常
************************************************************************************************/
int fn_wp_flow_app(unsigned char *node_name,unsigned char *p_err);


#ifdef __cplusplus
}
#endif

#endif
